class CoronaInfoType:
    BORDERS = 'borders'
    REQUIREMENTS = 'requirements'

    @classmethod
    def values(cls):
        return [attr_value for attr_key, attr_value in cls.__dict__.items() if not attr_key.startswith('__')]


class CoronaArticleTableColumn:
    COUNTRY_NAME = 1
    BORDER_INFO = 2
    RESTRICTION_INFO = 3


class Region:
    AMERICA = 'Северная и Южная Америка'
    EUROPE = 'Европа'
    ASIA = 'Азия и Океания'
    CIS = 'СНГ, Грузия, Абхазия и Южная Осетия'
    AFRICA = 'Африка, Ближний и Средний Восток'


REGION_TO_COUNTRIES = {
    Region.AMERICA: sorted(['Аргентина', 'Багамские острова', 'Белиз', 'Боливия', 'Бразилия', 'Венесуэла', 'Гайана', 'Гватемала', 'Гондурас', 'Доминиканская Республика', 'Канада', 'Колумбия', 'Коста-Рика', 'Куба', 'Мексика', 'Никарагуа', 'Панама', 'Парагвай', 'Перу', 'Сальвадор', 'США', 'Суринам', 'Уругвай', 'Чили', 'Эквадор']),
    Region.EUROPE: sorted(['Австрия', 'Албания', 'Бельгия', 'Болгария', 'Босния и Герцеговина', 'Великобритания', 'Венгрия', 'Германия', 'Греция', 'Дания', 'Ирландия', 'Исландия', 'Испания', 'Италия', 'Кипр', 'Латвия', 'Литва', 'Люксембург', 'Мальта', 'Нидерланды', 'Норвегия', 'Польша', 'Португалия', 'Румыния', 'Сан-Марино', 'Северная Македония', 'Сербия', 'Словакия', 'Словения', 'Турция', 'Финляндия', 'Франция', 'Хорватия', 'Черногория', 'Чехия', 'Швейцария', 'Швеция', 'Эстония']),
    Region.ASIA: sorted(['Австралия', 'Бангладеш', 'Бруней-Даруссалам', 'Вьетнам', 'Демократическая Республика Восточный Тимор', 'Индия', 'Индонезия', 'Камбоджа', 'Кирибати', 'КНДР', 'КНР', 'Лаос', 'Малайзия', 'Мальдивская Республика', 'Монголия', 'Мьянма', 'Науру', 'Непал', 'Новая Зеландия', 'Пакистан', 'Папуа-Новая Гвинея', 'Республика Вануату', 'Республика Корея', 'Республика Фиджи', 'Самоа', 'Сингапур', 'Таиланд', 'Тонга', 'Тувалу', 'Филиппины', 'Шри-Ланка', 'Япония']),
    Region.CIS: sorted(['Абхазия', 'Азербайджан', 'Армения', 'Белоруссия', 'Грузия', 'Казахстан', 'Киргизия', 'Молдавия', 'Таджикистан', 'Туркменистан', 'Узбекистан', 'Украина', 'Южная Осетия']),
    Region.AFRICA: sorted(['Алжир', 'Ангола', 'Афганистан', 'Бахрейн', 'Бенин', 'Ботсвана', 'Буркина Фасо', 'Габон', 'Гана', 'Гвинея', 'Гвинея-Бисау', 'Демократическая Республика Конго', 'Джибути', 'Египет', 'Замбия', 'Зимбабве', 'Израиль', 'Иордания', 'Ирак', 'Иран', 'Кабо-Верде', 'Камерун', 'Катар', 'Кения', 'Конго (Республика Конго)', 'Кот-д’Ивуар', 'Кувейт', 'Лесото', 'Либерия', 'Ливан', 'Маврикий', 'Мавритания', 'Мадагаскар', 'Малави', 'Мали', 'Марокко', 'Мозамбик', 'Намибия', 'Нигер', 'Нигерия', 'ОАЭ', 'Оман', 'Руанда', 'Саудовская Аравия', 'Сейшельские острова', 'Сенегал', 'Сирия', 'Сомали', 'Сьерра-Леоне', 'Судан', 'Танзания', 'Того', 'Тунис', 'Уганда', 'Чад', 'Экваториальная Гвинея', 'Эритрея', 'Эфиопия', 'ЮАР', 'Южный Судан'])
}


REGION_TO_KEY_ARTICLE_NAME_PART = {
    Region.AMERICA: 'Северной и Южной Америки',
    Region.EUROPE: 'Европы',
    Region.ASIA: 'Азии и Океании',
    Region.CIS: 'СНГ, Грузию, Абхазию и Южную Осетию',
    Region.AFRICA: 'Африки, Ближнего и Среднего Востока',
}

MID_PAGE_URL_TEMPLATE = "https://mid.ru/ru/informatsiya_dlya_rossiyskikh_i_inostrannykh_grazhdan_v_svyazi_s_koronavirusnoy_infektsiey/?PAGEN_1={page}"
